# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Development
brew 'node'
brew 'php'
brew 'oh-my-posh'
brew 'fzf'
brew 'zoxide'
brew 'fastfetch'

# Apps
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'alt-tab'
cask 'blender'
cask 'figma'
cask 'firefox'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'istat-menus'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'minecraft'
cask 'mullvad-vpn'
cask 'obsidian'
cask 'pictogram'
cask 'raycast'
cask 'signal'
cask 'spotify'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-monaspace'