# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Development
brew 'node'
brew 'php'

# Apps
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'alt-tab'
cask 'bitwarden'
cask 'blender'
cask 'figma'
cask 'fontbase'
cask 'github'
cask 'google-drive'
cask 'hiddenbar'
cask 'iterm2'
cask 'loom'
cask 'macmediakeyforwarder'
cask 'microsoft-excel'
cask 'microsoft-word'
cask 'mullvadvpn'
cask 'onedrive'
cask 'pictogram'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-monaspace'