# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'yt-dlp'

# Development
brew 'node'
brew 'yarn'
brew 'php'
brew 'oh-my-posh'
brew 'fzf'
brew 'zoxide'
brew 'fastfetch'
brew 'hugo'

# Apps
cask 'adobe-creative-cloud'
cask 'affinity'
cask 'alt-tab'
cask 'blender'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'framer'
cask 'ghostty'
cask 'google-chrome'
cask 'google-drive'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'minecraft'
cask 'mullvad-vpn'
cask 'notion'
cask 'prismlauncher'
cask 'raycast'
cask 'spotify'
cask 'steam'
cask 'visual-studio-code'
cask 'whatsapp'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-monaspace'
cask 'font-monaspace-nf'